class Solution {
    public String solution(int n) {
        
        StringBuilder sb = new StringBuilder();
        
        while(n > 0) {
            int rest = n % 3;   // 나머지
            n /= 3; // 몫
            
            // 나머지가 0인 경우: 4이고 몫 - 1
            if(rest == 0) { 
                rest = 4;
                n--;
            }
            
            sb.append(rest);
        }
        
        return sb.reverse().toString();
    }
}
    
// 1 % 3 = 1 -> 1, 몫 0
// 2 % 3 = 2 -> 2, 몫 0
// 3 % 3 = 0 -> 4, 몫 1 → (몫 - 1 = 0)

// 4 % 3 = 1 -> 1, 몫 1
// 5 % 3 = 2 -> 2, 몫 1
// 6 % 3 = 0 -> 4, 몫 2 → (몫 - 1 = 1)

// 7 % 3 = 1 -> 1, 몫 2
// 8 % 3 = 2 -> 2, 몫 2
// 9 % 3 = 0 -> 4, 몫 3 → (몫 - 1 = 2)

// 10 % 3 = 1 -> 1, 몫 3
// 11 % 3 = 2 -> 2, 몫 3
// 12 % 3 = 0 -> 4, 몫 4 → (몫 - 1 = 3)

// 13 % 3 = 1 -> 1, 몫 4
// → 다음 수는 (몫 = 4) 기준으로 다시 계산
// → 4 % 3 = 1 -> 1, 몫 1
    